const a = 3; //сторона треугольника А
const b = 2; //сторона треугольника B
const c = 4; //сторона треугольника C

if (a < b + c && b < a + c && c < b + a) {
  console.log("треугольник возможен");
  if (a == b && b == c && a == c) {
    console.log("треугольник равносторонний");
  } else if (a == b || b == c || a == c) {
    console.log("треугольник равнобедренный");
  } else {
    if (
      a ** 2 + b ** 2 == c ** 2 ||
      a ** 2 + c ** 2 == b ** 2 ||
      b ** 2 + c ** 2 == a ** 2
    ) {
      console.log("треугольник разносторонний, прямоугольный");
    } else {
      console.log("треугольник разносторонний");
    }
  }
} else {
  console.log("треугольник невозможен");
}
